from langchain_core.documents import Document

texts = [
    """რას წარმოადგენს და სად მდებარეობს Central Park Towers პროექტი?
Central Park Towers არის 5 ვარსკვლავიანი ინტეგრირებული საკურორტო-სასტუმრო კომპლექსი, რომელიც მდებარეობს ალექსანდრე ყაზბეგის გამზირზე, თბილისის ცენტრალურ პარკთან ახლოს. კომპლექსი იმყოფება Radisson Blu-ს მმართველობის ქვეშ. ინფრასტრუქტურას კი წარმოდგენენ, მასპინძლობის, კვების, შოპინგის და გართობის სფეროში ცნობილი საერთაშორისო ბრენდები.
""",
    """რას წარმოადგენს Central Park Towers-ის ინფრასტრუქტურა? 
Central Park Towers-ის ინფრასტრუქტურა მოიცავს:
* საერთაშორისო ბრენდის 7 რესტორანს
* საქართველოში პირველ პრემიუმ კლასის სავაჭრო ცენტრს, Harvey Nichols-ის მმართველობით
* რეგიონში უდიდეს მულტიფუნქციურ დარბაზს, ღონისძიებების გასამართად, რომელიც იტევს 2500 ადამიანს
* საქართველოში უდიდეს კაზინოს, რომელიც იმართება მაკაოდან
* პრემიუმ კლასის სპა და გამაჯანსაღებელ ცენტრებს Spa Soul-ის მმართველობით
* ფართო პარკინგს და თანამედროვე საოფისე სივრცეებს
""",
    """როდის დასრულდება Central Park Towers-ის მშენებლობა?
Central Park Towers-ი უკვე აქტიური შენების პროცესშია, რომელიც 2025 წლის დეკემბერში დასრულდება. რაც გულისხმობს სასტუმროს ნომრების და სხვა ობიექტების მთლიანად კეთილმოწყობას.
""",
    """რა საინვესტიციო შესაძლებლობებს გვთავაზობს Central Park Towers პროექტი?
ჩვენ გთავაზობთ უნიკალურ შესაძლებლობას, შეიძინოთ ნომერი სასტუმრო Radisson Blu-ში $150,000-ად. ეს არის ინვესტიცია, რომელსაც შეუძლია მოიტანოს ყოველწლიურად $35,000 მოგება, რაც უზრუნველყოფს მაღალ შემოსავალს, დაახლოებით წლიურ 24%-ს.
""",
    """როგორ შემოდის შემოსავალი ჩემი ინვესტიციებიდან და შემდეგ როგორ ნაწილდება?
შემოსავალი შემოდის თქვენს მიერ შეძენილი სასტუმრო ნომრის გაქირავებით. შემოსავალი პროპორციულად იყოფა უნიკალურ მოდელზე დაფუძნებით ყველა ინვესტორს შორის. $150.000-ის გადახდის შემთხვევაში წლიური შემოსავალი შეადგენს $35.000-ს და მმართველი კომპანია საკუთარ თავზე აიღებს საოპერაციო ასპექტებს. უნიკალური მოდელი გარანტიას იძლევა, რომ ყველა ინვესტორი თანაბარ მოგებას მიიღებს სასტუმროს საერთო შემოსავლიდან.
""",
    """როგორ ვმართავთ სასტუმროს ნომერს და რა ხარჯები ახლავს თან?
კომპლექსში არსებული ყველა სასტუმრო ნომერი ექვემდებარება Radisson Blu-ს. მმართველობის საფასური შეადგენს ბრუნვიდან 15%-ს და ინვესტორები თავისუფლდებიან კომუნალურების და ფიქსირებული საექსპლუატაციო ხარჯებისგან. ნომრები სრულიად კეთილმოწყობილია, რაც საინვესტიციო გამოცდილების მაქსიმალურად კომფორტულ გარანტიას იძლევა.
""",
    """რამდენად არის დაცული ჩემი ინვესტიციები?
თქვენი ინვესტიციები დაცულია ყიდვა-გაყიდვის წინასწარი შეთანხმებით, რომელიც შესაძლებელია ხელმოწერილ იქნას პირადად თუ ონლაინ. საკუთრების უფლება გადმოგეცემათ, თანხის სრულად გადახდის შემდეგ, ხოლო შეთანხმება უზრუნველყოფს სრულ იურიდიულ დაცულობას. მსოფლიოს წამყვანი აუდიტ კომპანიები Deloitte და Ernst & Young არიან გამჭვირვალეობის და ნდობის გარანტები.
""",
    """რატომ არის საქართველო უსაფრთხო და მიმზიდველი ქვეყანა ინვესტირებისთვის?
საქართველო არის ქვეყანა სტაბილურად მზარდი ეკონომიკით, რომლის მამოძრავებელი ძალაა ტურიზმი, უძრავი ქონება და უცხოური ინვესტიციები. თავისი სტრატეგიული მდებარეობის დამსახურებით ევროპისა და აზიის გასაყარზე, საქართველომ შეძლო ბიზნესისათვის კეთილგანწყობილი გარემოს შექმნა, რომელიც შეიცავს დაბალ გადასახადებს და გამარტივებულ რეგულაციებს. ქვეყანა მიმზიდველია მდიდარი კულტურული წარსულით, საოცარი პეიზაჟებით და მზარდი ტურისტული სექტორით. საქართველო, როგორც ევროკავშირის წევრობის კანდიდატი და შენგენის ზონის ნაწილი, ინვესტორებს სთავაზობს ზრდის გრძელვადიან პოტენციალს და გლობალური კავშირების გაფართოებას.
""",
    """როგორ შემიძლია შევიძინო სასტუმროს ნომერი Central Park Towers-ში?
სასტუმროს ნომრის შეძენა მარტივია. თქვენ შეგიძლიათ გადაიხადოთ თანხა მთლიანად ან აირჩიოთ ჩვენი გადახდის ერთ-ერთი მოქნილი მეთოდი, რომელიც გთავაზობთ პირველად შენატანს 35%-ის ოდენობით, ხოლო დარჩენილ თანხას შემოიტანთ ყოველთვიურად მშენებლობის დროს. ან შეგიძლიათ ისარგებლოთ საბანკო კრედიტით, რომელსაც გადაანაწილებთ 60 თვეზე წინასწარი გადახდის საკომისიოს გარეშე.
""",
    """მაქვს თუ არა უფლება მივიღო საქართველოს ბინადრობის ნებართვა თუ შევიძენ სასტუმროს ნომერს?
დიახ, სასტუმროს ნომრის შეძენა Central Park Towers-ში გაძლევთ უფლებას აიღოთ საქართველოს ბინადრობის ნებართვა. ის მოგცემთ შესაძლებლობას იცხოვროთ და იმუშავოთ საქართველოში. ამასთანავე საქართველო არის ევროკავშირის წევრობის კანდიდატი და შენგენის ზონის წევრი.
""",
    """რა მოხდება თუ შემდგომ მომინდება სასტუმროს ნომრის გაყიდვა?
ნომრის შეძენის შემდეგ თქვენ შეგიძლიათ მისი გაყიდვა ნებისმიერ მომენტში. მაღალი მოთხოვნის და უნიკალური ლოკაციის დამსახურებით, უძრავი ქონების ფასი გაიზრდება და თქვენ ყოველთვის შეძლებთ მის მომგებიანად გაყიდვას.
""",
]

documents = [Document(page_content=txt) for txt in texts]
